# HardwoodImperfections Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Hardwood..::..HardwoodImperfections Property
Hardwood Class See Also
---
The property labeled "Relief Pattern" from the "Hardwood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string HardwoodImperfections { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HardwoodImperfections As String
	Get
```

Visual C++
---
```text
public:
static property String^ HardwoodImperfections {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".
# See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace